{"input": "Command: rm -rf documents/\n\nDescription: Remove the directory named \"documents\" and all its contents forcefully and recursively.", "output": ""}
{"input": "List the contents of the /usr/bin/ directory.", "output": "ls /usr/bin/"}
{"input": "Display a cartoon cow with a speech bubble saying \"Zsh is better than Fish\".", "output": "cowsay zsh>fish"}
{"input": "Exit is a command used to close the terminal window or log out of the current user session.", "output": "exit"}
{"input": "Show the location of the Python package manager `pip` that is being used.", "output": "which pip"}
{"input": "Count the number of characters in the variable CONTAINER_ID without including a newline character.", "output": "echo -n $CONTAINER_ID | wc -m"}
{"input": "Change directory to the project4_AmarBot folder located in the mit_classes/6.1060 directory within the Desktop directory.", "output": "cd ~/Desktop/mit_classes/6.1060/project4_AmarBot"}
{"input": "Displays the current working directory.", "output": "pwd"}
{"input": "Display the directory tree starting from the current directory, with files and directories color-coded. Show the modification date for each item in the tree.", "output": "tree -H . -D -c"}
{"input": "Change directory to two levels up from the current directory.", "output": "cd ../.."}
{"input": "Display a cow saying \"ihi\" with a \"paranoid\" appearance.", "output": "cowsay -p ihi"}
{"input": "Change the current directory to a specific path on the desktop where notes for MIT classes are stored.", "output": "cd ~/desktop/mit_classes/notes/notes"}
{"input": "List the contents of the current directory in long format, sorted by modification time in reverse order.", "output": "ls -lrt"}
{"input": "Display a directory tree structure, but only show directories (-d) while excluding any directory names that contain 'node_modules' or 'venv'.", "output": "tree -d -I 'node_modules|venv'"}
{"input": "Change directory to the location where custom Zsh scripts are stored.", "output": "cd $ZSH_CUSTOM"}
{"input": "Display a calendar for the month of February in the year 2024.", "output": "cal february 2024"}
{"input": "Display the list of directories where the shell looks for executable files when you type a command.", "output": "echo $PATH"}
{"input": "Display the directory structure of the current folder in a tree format with file sizes and color coding.", "output": "tree -D -c"}
{"input": "Retrieve the canonical name (CNAME) for the domain \"pigeon.hackmit.org\".", "output": "dig CNAME pigeon.hackmit.org +short"}
{"input": "Display information about the installed AWS CLI.", "output": "which aws"}
{"input": "Retrieve all the DNS information for the domain hackmit.org.", "output": "host -a hackmit.org"}
{"input": "Retrieve the contents of the clipboard and display them in the terminal.", "output": "pbpaste"}
{"input": "Display the directory structure starting from the \"dist\" directory with HTML links.", "output": "tree -H dist"}
{"input": "Display the directory tree structure with dates and times formatted as month day year hour:minute for each file and folder in the current directory.", "output": "tree -D --timefmt=\"%b %d %Y %R\""}
{"input": "Display system information.", "output": "uname"}
{"input": "Display the directory structure in a tree format while ignoring the \"node_modules\" directory.", "output": "tree -I \"node_modules/*\""}
{"input": "display a list of previously executed commands", "output": "history"}
{"input": "This command displays help information related to version control systems used by `go`.", "output": "go help vcs"}
{"input": "Display the contents of the file named `test.c`.", "output": "cat test.c"}
{"input": "List all files and directories in the current directory, including hidden files, and show detailed information for each entry. Additionally, display a 'D' instead of a directory prefix for directories and include only entries that match the pattern '%MMM'.", "output": "ls -laD '%MMM'"}
{"input": "Lookup the IP address associated with the domain name \"my.hackmit.org\".", "output": "nslookup my.hackmit.org"}
{"input": "Look up DNS information for the website www.azliu.cc for any record type.", "output": "dig www.azliu.cc any"}
{"input": "Display detailed information about the files and directories in the current directory.", "output": "ls -l"}
{"input": "Change the current directory to the parent directory.", "output": "cd .."}
{"input": "Set the environment variable `npm_config_python` to the specified path to the Python executable.", "output": "export npm_config_python=/path/to/python"}
{"input": "Change the working directory to the path specified by the environment variable NVIM and then into the subdirectory named LuaSnip.", "output": "cd ${NVIM}/LuaSnip"}
{"input": "modify the current theme in Spicetify configuration", "output": "spicetify config current_theme THEME_NAME"}
{"input": "Change the current directory to \"/usr/local\".", "output": "cd /usr/local"}
{"input": "Generate a tree structure of the current directory and its subdirectories, excluding files with specific extensions. Display the dates and times of the files in a specified format, using UTF-8 charset. Title the tree structure as \"Test\" and save the output to an HTML file named index.html.", "output": "tree -H . -I \"index.html|*.aux|*.fls|*.out|*.pre|*.synctex*\" -D --timefmt=\"%b %d %Y %R\" --charset utf-8 -T \"Test\" > index.html"}
{"input": "Display the directory structure in a tree-like format, showing only directories.", "output": "tree -d"}
{"input": "Display the version information of the vi text editor.", "output": "vi --version"}
{"input": "This command runs a script called \"rename-images.sh\" located in the specified directory and then exits the terminal.", "output": "/Users/andrew/Desktop/mit_classes/6.7900/proj/pytorch-AdaIN/input/style-art/rename-images.sh; exit"}
{"input": "List all files and directories in the current directory, including hidden ones, with detailed information displayed in long format. Also, sort the output by modification date and time, displaying it in the format \"month day year time\".", "output": "ls -laD '%b %d %Y %R'"}
{"input": "Display the running Docker containers on the system.", "output": "docker ps"}
{"input": "This command sets a variable `CONTAINER_ID` to the ID of a Docker container that has \"ballot-backend\" in its name by listing all running containers, filtering for the one with \"ballot-backend\" in its name, and then extracting the container ID.", "output": "CONTAINER_ID=\"(docker container ls | grep -i \"ballot-backend\" | awk '{print $1}')\""}
{"input": "Change the current directory to the Desktop folder within the user's home directory.", "output": "cd ~/Desktop"}
{"input": "Display the version of Python 3 installed on the system.", "output": "python3 --version"}
{"input": "This command is used to query the DNS records for the domain ekzhang.com specifically for the Canonical Name (CNAME) record.", "output": "dig ekzhang.com cname"}
{"input": "Save the command history to a file named \"output.txt\".", "output": "history > output.txt"}
{"input": "Change the current directory to the \"notes\" folder within the \"mit_classes\" folder on the Desktop.", "output": "cd ~/Desktop/mit_classes/notes"}
{"input": "Change directory to the folder named \"6.5660\" located within the \"mit_classes\" folder on the Desktop.", "output": "cd ~/Desktop/mit_classes/6.5660"}
{"input": "This command is used to display the information about the Homebrew package manager installed on the system.", "output": "which brew"}
{"input": "List the contents of the current directory.", "output": "ls"}
{"input": "Print the number of Cilk workers currently active in the system.", "output": "$CILK_NWORKERS"}
{"input": "This command runs a Python script named `unet.py`, and then pipes the output of the script to the `pbcopy` command which copies the output to the clipboard.", "output": "python3 unet.py | pbcopy"}
{"input": "Query the DNS record for the website www.azliu.cc without displaying any statistics, comments, or the command itself.", "output": "dig www.azliu.cc +nostats +nocomments +nocmd"}
{"input": "Display the contents of a text file on the terminal, one page at a time.", "output": "more"}
{"input": "Print the length of each line in the output of a command or file represented by $CONTAINER_ID.", "output": "$CONTAINER_ID | awk '{print length}'"}
{"input": "Change the current directory to the /home directory.", "output": "cd /home"}
{"input": "This command is asking to list all files and directories in the current directory, including hidden ones, showing detailed information for each item, but it is also trying to interpret `'%ddd'` as a directory or file name, despite the command not having a clear purpose.", "output": "ls -laD '%ddd'"}
{"input": "Set the current theme in spicetify to \"Ziro\".", "output": "spicetify config current_theme Ziro"}
{"input": "List all containers, search for 'ballot-backend' case-insensitively, and display the entire content of each line.", "output": "docker container ls | grep -i ballot-backend | awk 1"}
{"input": "Generate a tree structure of the current directory with the header \"Test\", excluding files with names containing \"index.html\" or ending in \".aux\". The output will be formatted with dates and times in a specific format, and the output file will be saved as index.html.", "output": "tree -H . -I \"index.html|*.aux\" -D --timefmt=\"%b %d %Y %R\" --charset utf-8 -T \"Test\" > index.html"}
{"input": "This command uses the `dig` tool to query DNS information for the domain name \"www.ekzhang.com\" with the record type \"any\".", "output": "dig www.ekzhang.com any"}
{"input": "Output the value of the environment variable NVIMRC.", "output": "echo ${NVIMRC}"}
{"input": "Set the system's PATH variable to include the /Downloads directory as one of the locations to search for executable files.", "output": "export PATH=\"/Downloads:$PATH\"\\n"}
{"input": "Change the current directory to the \"Themes\" folder within the \".config/spicetify\" directory in the home directory.", "output": "cd ~/.config/spicetify/Themes"}
{"input": "Display the Go programming language version installed on the system.", "output": "go version"}
{"input": "Display the canonical name (CNAME) record for the domain hackmit.org.", "output": "dig hackmit.org CNAME"}
{"input": "This command retrieves the mail exchange (MX) records for the domain hackmit.org in a concise format.", "output": "dig MX hackmit.org +short"}
{"input": "Change the current directory to the hidden directory where Zsh session files are stored.", "output": "cd ~/.zsh_sessions"}
{"input": "This command prints the value of the environment variable ZSHRC.", "output": "echo $ZSHRC"}
{"input": "This command is used to map hostnames to IP addresses.", "output": "host bore.pub"}
{"input": "Displays the calendar for the month of January in the year 2024.", "output": "cal january 2024"}
{"input": "Display a tree structure of the current directory and include file dates in the output.", "output": "tree -H . -D"}
{"input": "Change directory to /usr/local/", "output": "cd /usr/local/"}
{"input": "This command looks up and queries DNS records for the domain \"bore.pub\".", "output": "dig bore.pub"}
{"input": "Display only the IP address record for the domain www.azliu.cc using the `dig` command without any additional information.", "output": "dig +noall +answer www.azliu.cc"}
{"input": "List detailed information for all files in the `/usr/bin` directory starting with `python`.", "output": "ls -ls /usr/bin/python*"}
{"input": "Retrieve the CNAME record for the domain www.ekzhang.com.", "output": "dig www.ekzhang.com cname"}
{"input": "Change the current directory to ~/.config/zathura inside the Dotfiles directory.", "output": "cd ~/Dotfiles/.config/zathura"}
{"input": "This command checks if the value of a variable called `$len` is equal to 12. If the condition is true, it will display \"hi\".", "output": "if (($len == 12)); then echo \"hi\"; fi"}
{"input": "Change the current working directory to \"mit_classes\" within the \"Desktop\" directory in your home folder.", "output": "cd ~/Desktop/mit_classes"}
{"input": "Display the version of Python that is currently installed on the system.", "output": "python --version"}
{"input": "The command `aa` is not a valid terminal command in MacOS.", "output": "aa"}
{"input": "Set the number of worker threads for the Cilk Plus runtime system to 1.", "output": "CILK_NWORKERS=1"}
{"input": "Display the processor type information.", "output": "uname -p"}
{"input": "List all files and directories, including hidden ones, with detailed information, and exclude group and others permissions, filtering by files modified on a Monday.", "output": "ls -laD '%Mon'"}
{"input": "Change directory to the \"torch\" directory located in the home directory.", "output": "cd ~/torch"}
{"input": "Query the DNS records for hackmit.org.", "output": "dig hackmit.org"}
{"input": "List all files (including hidden files) in the current directory.", "output": "ls -a"}
{"input": "Look up the canonical name (CNAME) record for the website www.ekzhang.com.", "output": "nslookup -type=cname www.ekzhang.com"}
{"input": "Change the current directory to \"mit_classes/6.8611\" inside the \"Desktop\" directory in your home folder.", "output": "cd ~/Desktop/mit_classes/6.8611"}
{"input": "Display the directory structure in color.", "output": "tree -C"}
{"input": "Displays the path to the location of the pip3 executable.", "output": "which pip3"}
{"input": "Display the help information for the Go programming language.", "output": "go help"}
{"input": "Change the current directory to \"hw3\" located in the path \"~/Desktop/mit_classes/6.8611/\".", "output": "cd ~/Desktop/mit_classes/6.8611/hw3"}
{"input": "Change the current working directory to /usr/local/bin.", "output": "cd /usr/local/bin"}
{"input": "Display a speech bubble with the text \"hi\" inside of it, using an ASCII art of a cow.", "output": "cowsay \"hi\""}
{"input": "Change the current directory to the \".config/latexmk\" directory within the \"Dotfiles\" directory located in the user's home directory.", "output": "cd ~/Dotfiles/.config/latexmk"}
{"input": "Print the value stored in the variable named CONTAINER_ID.", "output": "echo $CONTAINER_ID"}
{"input": "Change the current directory to the \"Downloads\" directory in the user's home directory.", "output": "cd ~/Downloads/"}
{"input": "Change the current directory to its parent directory.", "output": "cd . ."}
{"input": "Generate a tree structure of the current directory, and save the output in an HTML file named `index.html`.", "output": "tree -H . > index.html"}
{"input": "Display the directory tree recursively with the date and time of last modification shown.", "output": "tree -D"}
{"input": "Count the number of characters in the variable $CONTAINER_ID.", "output": "len=$(echo -n $CONTAINER_ID | wc -m)"}
{"input": "Display a tree structure of files and directories in the current directory, including file sizes and dates, excluding any files named \"index.html\".", "output": "tree -H . -I \"index.html\" -Dc"}
{"input": "This command clears the terminal screen, removing all previous commands and output from view.", "output": "clear"}
{"input": "This command activates a virtual environment located at `/Users/andrew/Desktop/mit_classes/6.7900/proj/pytorch-AdaIN/venv`.", "output": "source /Users/andrew/Desktop/mit_classes/6.7900/proj/pytorch-AdaIN/venv/bin/activate"}
{"input": "Change the current directory to the Desktop.", "output": "cd Desktop"}
{"input": "This command lists all available Python versions that can be installed using pyenv.", "output": "pyenv install --list"}
{"input": "Change the current working directory to the current directory.", "output": "cd ."}
{"input": "List the contents of the current directory.", "output": "LS"}
{"input": "This command is likely a custom command and does not correspond to a standard MacOS terminal command.", "output": "leave 0316"}
{"input": "Query the DNS records for the domain azliu.cc without displaying the additional information.", "output": "dig +noall +answer azliu.cc"}
{"input": "Set an environment variable named `len` to the value `12` and then print the value of the variable `len`.", "output": "echo $len>12"}
{"input": "This command will output the number of characters in the variable `$CONTAINER_ID`.", "output": "echo {#$CONTAINER_ID}"}
{"input": "Look up the canonical name (CNAME record) for the domain www.azliu.cc.", "output": "nslookup -type=cname www.azliu.cc"}
{"input": "Display the version of Node.js that is currently installed.", "output": "node --version"}
{"input": "Displays the version of Node.js that is currently installed on the system.", "output": "node -v"}
{"input": "Search for a file within the current directory with the given inode number 28709373.", "output": "find . -inum 28709373"}
{"input": "Look up the mail exchange (MX) records for the domain \"my.hackmit.org\" in a concise format.", "output": "dig MX my.hackmit.org +short"}
{"input": "Change the current directory to the desktop folder in the user's home directory.", "output": "cd ~/desktop"}
{"input": "Display a cow saying \"lllll\".", "output": "cowsay lllll"}
{"input": "Display the location of the AWS command.", "output": "which aws\\"}
{"input": "Set an environment variable called OPENAI_API_KEY with the value of \"esecret_s72mkg4giez16zfuhfcdp54ajq\".", "output": "export OPENAI_API_KEY=\"esecret_s72mkg4giez16zfuhfcdp54ajq\""}
{"input": "Create a tree structure of the current directory and save it as an HTML file excluding the file named \"index.html\".", "output": "tree -H . -I 'index.html' > index.html"}
{"input": "Display the version information for the `make` command.", "output": "make -v"}
{"input": "Change directory to the zathura configuration folder in the user's home directory.", "output": "cd ~/.config/zathura"}
{"input": "Display information about the specified IP address.", "output": "host 3.92.255.125"}
{"input": "List all files and directories in long format with details about permissions, ownership, size, and timestamps, including hidden files, and use non-printing characters to format the output.", "output": "ls -laD '%b'"}
{"input": "Query the canonical name (CNAME) record for the domain google.com using the nslookup command.", "output": "nslookup -q=cname google.com"}
{"input": "Look up the mail exchange (MX) records for the domain my/hackmit.org.", "output": "dig MX my/hackmit.org +short"}
{"input": "Display the help menu for the `bore` command.", "output": "bore --help"}
{"input": "Set the maximum number of open file descriptors for the current session to 1024.", "output": "ulimit -n 1024"}
{"input": "Display the help information for the `aa` command.", "output": "aa --help"}
{"input": "Change the current working directory to /usr/bin.", "output": "cd /usr/bin"}
{"input": "Change the current working directory to the hidden directory \".oh-my-zsh\".", "output": "cd ~/.oh-my-zsh/"}
{"input": "Change the working directory to the \"server\" folder within the \"dev-workshop\" directory located on the \"hackmit\" directory within the user's Desktop.", "output": "cd ~/Desktop/hackmit/dev-workshop/server"}
{"input": "This command displays your entire zsh history.", "output": "history 0"}
{"input": "Generate a tree view of the current directory and its subdirectories, excluding any files named 'index.html'. Display the tree with the modification dates in a specific format and UTF-8 character encoding. Save this tree structure to an HTML file named 'index.html'. After creating the HTML file, navigate up one directory level.", "output": "tree -H . -I 'index.html' -D --timefmt='%b %d %Y %R' --charset utf-8 -T 'mit-notes' > index.html && cd .."}
{"input": "Query the DNS server for the IP address of the website www.azliu.cc.", "output": "dig www.azliu.cc"}
{"input": "Display the version of Python 3.10 installed on the system.", "output": "python3.10 --version"}
{"input": "Display a list of files and directories in the `/usr/local/include` directory.", "output": "ls /usr/local/include"}
{"input": "List the contents of the /usr/bin directory.", "output": "ls /usr/bin"}
{"input": "This command prints the path to the zsh (Z shell) binary file in the /bin directory.", "output": "echo /bin/zsh"}
{"input": "The `tree` command generates a directory tree starting from the current directory. It includes all subdirectories and files within them. In this specific command, the directory tree is being generated, excluding any files named \"index.html\", and the output is being saved to an HTML file named \"index.html\". The tree is formatted using UTF-8 encoding, with dates displayed in a specific format, and the title of the HTML file is set to \"Test\".", "output": "tree -H . -I \"index.html\" -D --timefmt=\"%b %d %Y %R\" --charset utf-8 -T \"Test\" > index.html"}
{"input": "Display the directory tree structure with the date and time of each file's last modification in the specified format.", "output": "tree -D --timefmt=\"%b %d %y %R\""}
{"input": "Change the current directory to the user's home directory.", "output": "cd ~"}
{"input": "Change directory to the hidden directory named \"custom\" located inside the \".oh-my-zsh\" directory in the user's home directory.", "output": "cd ~/.oh-my-zsh/custom/"}
{"input": "Change the current directory to \"hackmit\" located on the Desktop.", "output": "cd ~/Desktop/hackmit"}
{"input": "Display a speech bubble with ASCII art of a cow saying \"hello\".", "output": "cowsay hello"}
{"input": "Set the base URL for OpenAI's API to \"https://api.endpoints.anyscale.com/v1\".", "output": "export OPENAI_BASE_URL=\"https://api.endpoints.anyscale.com/v1\""}
{"input": "Display a tree structure of the files and directories in the current directory, excluding any files or directories with the name \"index.html\", and show the HTML output.", "output": "tree -H . -I \"index.html\""}
{"input": "Retrieve the DNS information for the domain hackmit.com.", "output": "dig hackmit.com"}
{"input": "Create a new file named \"out.txt\" and display its filename.", "output": "echo out.txt"}
{"input": "Delete the oldest message from the terminal.", "output": "leave 1"}
{"input": "Change the current working directory.", "output": "cd"}
{"input": "Compare two files side by side, showing a maximum of 1 line of context.", "output": "fc -l -n 1"}
{"input": "Displays a random quote or saying using the `fortune` command, and then pipes the output to the `cowsay` command with a cow image in the shape of cheese to display the quote or saying in a fun and creative way.", "output": "fortune | cowsay -f cheese"}
{"input": "Display the calendar for the year 2023.", "output": "cal 2023"}
{"input": "Remove the last line from the file index.html using the stream editor 'sed'.", "output": "sed '$d' index.html"}
{"input": "Change directory to the folder `18.615` located inside the `mit_classes` directory on the desktop.", "output": "cd ~/Desktop/mit_classes/18.615"}
{"input": "Change directory to the \"Dotfiles\" directory inside the user's home directory.", "output": "cd ~/Dotfiles/"}
{"input": "Display the directory structure in a tree format, excluding any directories or files with names containing \"node_modules\".", "output": "tree -I node_nodules"}
